In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df=pd.read_csv('real_estate_data.csv')
df

         City         Location  Area (sqft)  Price (in Lakhs)  Year
0     Chennai      Viman Nagar         1110            252.32  2022
1        Pune        Sector 18         2029             74.77  2012
2        Pune        Velachery         4357            416.53  2012
3       Noida        Sector 18         1362            116.28  2010
4       Noida           Dwarka          794            112.74  2016
...       ...              ...          ...               ...   ...
4995  Chennai          T Nagar         3002            356.86  2018
4996  Chennai  Connaught Place         4930            243.54  2024
4997    Delhi       Anna Nagar         2160            461.75  2003
4998     Pune            Baner         4921            129.18  2011
4999    Delhi           Dwarka         1059            364.01  2022

[5000 rows x 5 columns]

In [4]:
df.shape

(5000, 5)

In [8]:
df.columns

Index(['City', 'Location', 'Area (sqft)', 'Price (in Lakhs)', 'Year'], dtype='object')

In [9]:
df.columns = df.columns.str.strip()

In [12]:
df.groupby('City')['City'].agg('count')

City
Bangalore    820
Chennai      849
Delhi        857
Hyderabad    833
Noida        838
Pune         803
Name: City, dtype: int64

In [18]:
df1 = df.copy()
df1 = df1.drop(['City', 'Location', 'Area (sqft)'], axis='columns')
df1.head()

   Price (in Lakhs)  Year
0            252.32  2022
1             74.77  2012
2            416.53  2012
3            116.28  2010
4            112.74  2016

In [19]:
df1.isnull().sum()

Price (in Lakhs)    0
Year                0
dtype: int64